In [1]:
import pandas as pd
import seaborn as sb

In [2]:
df = pd.read_csv ('Real estate.csv')

In [3]:
df.head ()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [4]:
df.isnull (). sum ()

No                                        0
X1 transaction date                       0
X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64

# Separate x,y

In [5]:
x = df. drop ('Y house price of unit area', axis = 1)

In [6]:
x.head ()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245

In [7]:
y = df ['Y house price of unit area']

In [8]:
y.head ()

0    37.9
1    42.2
2    47.3
3    54.8
4    43.1
Name: Y house price of unit area, dtype: float64

# Feature Transformation after train_test

In [9]:
from sklearn.model_selection import train_test_split

In [10]:
xtrain,xtest,ytrain,ytest = train_test_split (x,y,test_size = .30, random_state = 42)

In [11]:
xtrain.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
7,8,2013.417,20.3,287.60250,6,24.98042,121.54228
194,195,2013.500,15.2,3771.89500,0,24.93363,121.51158
19,20,2012.667,1.5,23.38284,7,24.96772,121.54102
176,177,2012.833,13.9,4573.77900,0,24.94867,121.49507
367,368,2012.833,15.0,1828.31900,2,24.96464,121.51531

In [12]:
xtrain.columns

Index(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'],
      dtype='object')

# Min Max Scaler

In [13]:
from sklearn.preprocessing import MinMaxScaler

In [14]:
MinMax = MinMaxScaler ()

In [15]:
train_fit = MinMax.fit_transform (xtrain) # transform xtrain

In [16]:
train_fit.shape

(289, 7)

In [17]:
new_df = pd.DataFrame (train_fit, columns = ['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'])

In [18]:
xtrain = new_df

In [19]:
xtrain.head ()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,0.014563,0.818777,0.475410,0.042055,0.6,0.577940,0.736692
1,0.468447,0.909389,0.355972,0.596634,0.0,0.000000,0.399737
2,0.043689,0.000000,0.035129,0.000000,0.7,0.421072,0.722862
3,0.424757,0.181223,0.325527,0.724266,0.0,0.185771,0.218527
4,0.888350,0.181223,0.351288,0.287283,0.2,0.383029,0.440676

In [20]:
xtest.columns

Index(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'],
      dtype='object')

In [21]:
xtest_tf = MinMax.transform (xtest) # transform xtest

In [22]:
xtest_tf.shape

(125, 7)

In [23]:
xtest_df = pd.DataFrame (xtest_tf)

In [24]:
xtest_df = xtest

In [25]:
xtest.head ()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
358,359,2013.167,1.1,193.5845,6,24.96571,121.54089
350,351,2013.000,13.2,492.2313,5,24.96515,121.53737
373,374,2013.083,0.0,274.0144,1,24.97480,121.53059
399,400,2012.917,12.7,170.1289,1,24.97371,121.52984
369,370,2012.667,20.2,2185.1280,3,24.96322,121.51237

# Feature Transformation befor train_test

# Min Max Scaler

In [26]:
df = pd.read_csv ('Real estate.csv')

In [27]:
x = df. drop ('Y house price of unit area', axis = 1)

In [28]:
y = df ['Y house price of unit area']

In [29]:
x.columns

Index(['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'],
      dtype='object')

In [30]:
from sklearn.preprocessing import MinMaxScaler

In [31]:
scaler = MinMaxScaler ()

In [32]:
x_fit = scaler.fit_transform (x)

In [33]:
x_fit.shape

(414, 7)

In [34]:
new_df = pd.DataFrame (x_fit, columns = ['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'])

In [81]:
x = new_df

In [82]:
x.head ()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,0.000000,0.272926,0.730594,0.009513,1.0,0.616941,0.719323
1,0.002421,0.272926,0.445205,0.043809,0.9,0.584949,0.711451
2,0.004843,1.000000,0.303653,0.083315,0.5,0.671231,0.758896
3,0.007264,0.909389,0.303653,0.083315,0.5,0.671231,0.758896
4,0.009685,0.181223,0.114155,0.056799,0.5,0.573194,0.743153

# Standard Scaler

In [36]:
df = pd.read_csv ('Real estate.csv')

In [37]:
x2 = df. drop ('Y house price of unit area', axis = 1)

In [38]:
y2 = df ['Y house price of unit area']

In [39]:
from sklearn.preprocessing import StandardScaler

In [40]:
std_scaler = StandardScaler()

In [41]:
x2.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245

In [42]:
fit_std = std_scaler.fit_transform (x2)

In [43]:
fit_std.shape

(414, 7)

In [44]:
std_df = pd.DataFrame (fit_std, columns = ['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'])

In [79]:
x2 = std_df

In [80]:
x2.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,-1.727872,-0.823683,1.255628,-0.792495,2.007407,1.125430,0.448762
1,-1.719505,-0.823683,0.157086,-0.616612,1.667503,0.912444,0.401139
2,-1.711137,1.541151,-0.387791,-0.414015,0.307885,1.486860,0.688183
3,-1.702770,1.246435,-0.387791,-0.414015,0.307885,1.486860,0.688183
4,-1.694402,-1.121951,-1.117223,-0.549997,0.307885,0.834188,0.592937

# Max abs Scaler

In [46]:
df = pd.read_csv ('Real estate.csv')

In [50]:
x3 = df. drop ('Y house price of unit area', axis = 1)

In [51]:
y3 = df ['Y house price of unit area']

In [52]:
from sklearn.preprocessing import MaxAbsScaler

In [53]:
max_sca = MaxAbsScaler ()

In [54]:
max_fit = max_sca.fit_transform (x3)

In [56]:
max_fit.shape

(414, 7)

In [58]:
 df3 = pd.DataFrame (max_fit, columns = ['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'] )

In [76]:
x3 = df3

In [78]:
x3.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245

# Robust Scaler

In [63]:
df = pd.read_csv ('Real estate.csv')

In [65]:
x4 = df. drop ('Y house price of unit area', axis = 1)

In [66]:
y4 = df ['Y house price of unit area']

In [62]:
from sklearn.preprocessing import RobustScaler

In [67]:
rob_sca = RobustScaler ()

In [68]:
rob_fit = rob_sca.fit_transform (x4)

In [70]:
rob_fit.shape

(414, 7)

In [71]:
df4 = pd.DataFrame (rob_fit, columns = ['No', 'X1 transaction date', 'X2 house age',
       'X3 distance to the nearest MRT station',
       'X4 number of convenience stores', 'X5 latitude', 'X6 longitude'] )

In [74]:
x4 = df4

In [77]:
x4.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245